# core desktop
niri
ghostty
dolphin
fish
zsh
neovim
eza
btop

# wayland tools
xdg-desktop-portal
xdg-desktop-portal-gtk
wl-clipboard
cliphist
grim
slurp
brightnessctl
hyprpicker
pipewire
wireplumber

# shell / terminal extras
fastfetch
starship
zoxide

# theming
papirus-icon-theme
qt5ct-kde
qt6ct-kde

# file search backend
go
