# core desktop
git
sddm
ghostty
dolphin
fish
zsh
neovim
eza
btop
rsync

# wayland tools
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-gnome
xdg-user-dirs
wl-clipboard
cliphist
grim
slurp
brightnessctl
hyprpicker

# audio
pipewire
pipewire-pulse
wireplumber

# shell / terminal extras
fastfetch
starship
zoxide

# connectivity and device integration
networkmanager
plasma-nm
bluez
bluez-utils
bluedevil
upower
gnome-keyring

# desktop auth integration
polkit-kde-agent

# theming
fontconfig
papirus-icon-theme
qt5ct-kde
qt6ct-kde

# file search backend
go
